# Day 5

In [42]:
import pandas as pd
df=pd.read_csv('day5.txt', header=None)
df.columns=['code']
df.head()

         code
0  FBFBFFBLLR
1  FBBBFFBLLL
2  BFBFFFFRRR
3  BFBBBFBRLL
4  FBFBBFBLLL

In [43]:
df['rrow']=df.code.apply(lambda x: int(x[:7].replace("F","0").replace("B","1"),2))
df['ccol']=df.code.apply(lambda x: int(x[7:].replace("L","0").replace("R","1"),2))
df['seat']=df.apply(lambda x: x.rrow*8 + x.ccol, axis=1)
df=df.sort_values('seat')
df.tail()

           code  rrow  ccol  seat
344  BBBFBFFRRL   116     6   934
621  BBBFBFFRRR   116     7   935
269  BBBFBFBLLL   117     0   936
745  BBBFBFBLLR   117     1   937
677  BBBFBFBLRL   117     2   938

In [41]:
# what's missing
df['seq']=df.seat-df.seat.shift(1)
df[df.seq!=1]

           code  rrow  ccol  seat  diff  seq
171  FFFBFFFRRL     8     6    70   NaN  NaN
423  BFBFBBBLLR    87     1   697   2.0  2.0